<html>
	<head>
		<title>Bitacora de Actividades</title>
	</head>

	<body leftmargin="10px" topmargin="30px" rightmargin="10px" >
		<h2> <b>
			<center>Bit&aacute;cora de Actividades:</center>
		</b> <h2>

		<p >
			<h4>
			<b>Integrantes:<br></b>
				Oswaldo Bayona Andrade<br>
				Rodrigo Castro Reyes<br>
				Jorge Vergara Palma<br>
		    </h4>
		</p>
		<hr/>
		<p>
			<h4>
				<b>Primer d&iacute;a:</b>
			</h4>
			Fecha: Mi&eacute;rcoles 11 de junio del 2014.<br>
			Hora: 4:30 pm a 5:30 pm<br>
			Lugar: Plazoleta de la Fiec Espol<br>
			Asistencia: todos fuimos.<br>
			En esa tarde, nos reunimos para intentar colocar la tetera de Utah en la escena del proyecto anterior, no lo conseguimos, pero encontramos un ejemplo en este sitio:
			<a href="http://joshondesign.com/p/books/canvasdeepdive/chapter10.html"> link</a> donde importaban un modelo (toroide).<br> Para colocar la tetera descargamos el archivo desde aqu&iacute;: <a href="http://joshondesign.com/p/books/canvasdeepdive-examples/WebGL/ "> link</a>, entonces la colocamos en ese nuevo proyecto.
			</a><br>

		</p>
		
		<hr/>
		<p>
			<h4>
				<b>Segundo d&iacute;a: </b>
			</h4>
			Fecha: jueves 12 de junio del 2014.<br>
			Hora: 6:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa.<br>

			Actividades: Oswaldo intent&oacute; colocar la tetera en la escena del proyecto anterior, m&aacute;s sin embargo no le sali&oacute;, entonces coloc&oacute; los otros elementos en la nueva escena; la escena estaba tomando la forma adecuada. Se cre&oacute; este repositorio en github:  <a href="https://github.com/obayona/Segundo-Proyecto-Threejs-GPC">Repositorio</a> donde se subi&oacute; el nuevo proyecto, esas fueron todas las actividades.<br>

		</p>
		<hr/>
		<p>
			<h4>
				<b>Tercer d&iacute;a:</b>
			</h4>
			Fecha: viernes 13 de junio del 2014.<br>
			Hora: 6:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Jorge y Rodrigo quer&iacute;an probar el proyecto hecho por Oswaldo, el problema es que en el Navegador Chrome no sal&iacute;a nada, Oswaldo hab&iacute;a probado en Safari pero la escena se ve&iacute;a mal,  adem&aacute;s el proyecto anterior no val&iacute;a en Safari pero s&iacute; en Chrome,  este problema se corrigi&oacute; activando WebGl en Safari, y probando con el navegador Firefox.


		</p>

		<hr/>
		<p>
			<h4>
				<b>Cuarto d&iacute;a: </b>
			</h4>
			Fecha: s&aacute;bado 14 de junio del 2014.<br>
			Hora: 11:30 am<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Rodrigo y Jorge intentaron colocar la animaci&oacute;n de &oacute;rbita de los objetos alrededor de la tetera,  pero no lo lograban, entonces Rodrigo consigui&oacute; lo que el primer d&iacute;a no logramos, colocar la tetera en la escena del proyecto anterior, luego decidimos crear otro repositorio en github: <a href="https://github.com/rodrigoCastroReyes/CG_SegundoProyecto">Repositorio</a>  pero mantener el anterior porque ah&iacute; ya estaba implementada la funcionalidad de mover la c&aacute;mara. Despu&eacute;s Jorge coloc&oacute; los movimientos, y Rodrigo los controles para variar las velocidades de traslaci&oacute;n de los objetos. 
			

		</p>
		<hr/>

		<p>
			<h4>
				<b>Quinto d&iacute;a: </b>
			</h4>
			Fecha: lunes 16 de junio del 2014.<br>
			Hora: 7:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Oswaldo encontr&oacute; otro tipo de controles que pueden desplegarse y cerrarse, en este ejemplo <a href="http://www.realtimerendering.com/udacity/?load=demo/unit1-teapot-demo.js">Ejemplo</a>, Rodrigo los us&oacute; para organizar mejor los controles; Oswaldo coloc&oacute; los objetos en nuevas posiciones para que la escena se aprecie mejor. Bas&aacute;ndose en el primer intento de proyecto, Jorge agreg&oacute; la capacidad de acercar la c&aacute;mara.
 
		</p>
		<hr/>

		<h4>
			<b>Sexto d&iacute;a: </b>
			</h4>
			Fecha: martes 17 de junio del 2014.<br>
			Hora: 7:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades:  Rodrigo agreg&oacute; controles, para hacer variar los shadings entre Flat, Gouraud y Phong; s&oacute;lo se pusieron los controles pero no funcionaban los shadings. Rodrigo puso la funcionalidad de rotar los objetos sobre su propio eje cuando se escoge Gourand Shading.

		</p>

		</p>
		<hr/>
		<h4>
			<b>Septimo d&iacute;a: </b>
			</h4>
			Fecha: jueves 26 de junio del 2014 <br>
			Hora: 5:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades:  Rodrigo agreg&oacute; el control para detener todos los objetos de la escena, adem&aacute;s agreg&oacute; la funcionalidad de picking sobre los objetos de la escena basandose en este ejemplo: <a href="http://jsfiddle.net/mand/gzuwg/7/">Ejemplo</a>			
			Adicionalmente Oswaldo agreg&oacute; la funcionalidad para incorporar peque&ntilde;os satelites al rededor de los objetos. Jorge se encarg&oacute; de insertar diferentes luces dentro de la escena, adem&aacute;s puso controles para manejar el encendido y apagado de estas luces.

		</p>

		</p>
		<hr/>
		<h4>
			<b>Octavo d&iacute;a: </b>
			</h4>
			Fecha: viernes 27 de junio del 2014<br>
			Hora: 11:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades:  Rodrigo resolvi&oacute; el funcionamiento de los shading. El problema era que se intent&oacute; actualizar el tipo de material en tiempo de ejecucion pero esto no era permitido por three js. Luego de que revisamos documentaci&oacute;n encontramos que la &uacute;nica forma de solucionarlo era crear todos los objetos con sus respectivos materiales e irlos insertando y removiendo de la escena, seg&uacute;n corresponda. Esta informacion la encontramos aqui: <a href="https://github.com/mrdoob/three.js/issues/1929">SolucionProblemaShading</a>	
			

		</p>




	</body>
</html>