<html>
	<head>
		<title>Write-Up del Proyecto</title>
	</head>

	<body leftmargin="10px" topmargin="30px" rightmargin="10px" >
		<h2> <b>
			<center> &quot;Write-Up&quot; del Proyecto:</center>
		</b> <h2>

		<p >
			<h4>
			<b>Integrantes:<br></b>
				Oswaldo Bayona Andrade<br>
				Rodrigo Castro Reyes<br>
				Jorge Vergara Palma<br>
		    </h4>
		</p>
		<hr/>
		<p>
			
			El proyecto consiste en una escena formada por un fondo que simula el cielo, un plano, una tetera de Utah colocada en el centro, y de diferentes figuras que orbitan en una trayectoria circular alrededor de la tetera. Las diferentes figuras son un cubo, un toroide, una esfera y un pir&aacute;mide de base cuadrada. En la <b>figura1</b> se puede apreciar la escena en su estado inicial.<br><br>
			<img src = "imagenes/figura1.jpg" width="1000" height="600" border="4" aling = "middle">
			<br><hr><b>Figura1:</b> Imagen de la escena en su estado inicial. Se puede apreciar la tetera y los objetos orbit&aacute;ndola.<hr/><br>

			La escena esta iluminada por cuatro luces de tipo PointLight ubicadas en las esquinas del plano. En su estado inicial los objetos est&aacute;n pintadas con la t&eacute;cnica de Flat Shading. En la esquina superior izquierda se encuentran las estad&iacute;sticas de los FPS y en la esquina derecha, controles que explicamos a continuaci&oacute;n.<br> 
			Los controles est&aacute;n clasificado por 4 grupos, que se despliegan y muestran otros controles, y por 2 controles individuales, como se puede ver en la <b>figura2</b>, los grupos son:<br><br>
			<img src = "imagenes/figura2.jpg" width="600" height="400" border="4" aling = "middle">
			<br><hr/> <b>Figura2:</b> Controles para interactuar con escena.<hr/><br><br>

			<b>Speed of Objects:</b> Contiene barras que permiten variar las velocidades de traslaci&oacute;n de los objetos.<br><br>

			<b>Shadings:</b> Permite elegir entre Flat Shading, Gouraud Shading y Phong Shading, para pintar los elementos de la escena. Al elegir entre estas opciones, aparecen nuevas funciones, si se escoge  Gouraud o Phong Shading <b>(figura3)</b> los objetos rotan sobre sus ejes.  Si se selecciona Phong Shading se puede mover y acercar la c&aacute;mara para ver la escena desde otros &aacute;ngulos <b>(figura3)</b>, para esto se debe dar click en la escena y arrastar, as&iacute; se mueve la c&aacute;mara, y para acercar o alejar se lo hace moviendo la rueda del mouse hacia delante o hacia atr&aacute;s.<br> <br>

			<b>Lights:</b> Despliega checkbuttons que permiten al seleccionarlos encender una de las cuatro luces, y a deseleccionarlos apagar una luz.<br><br>

			<b>Types Lights:</b> Permite elegir el tipo de luz, se puede escoger entre PointLight y SpotLight.<br><br>
			<img src = "imagenes/figura3.jpg" width="1000" height="600" border="4" aling = "middle">

			<br><hr><b>Figura3:</b> Est&aacute; activado el Gouraud Shading, se pueden apreciar peque&ntilde;os sat&eacute;lites alrededor de los objetos, adem&aacute;s la c&aacute;mara se ha movido a otro punto.<hr/>


			Los controles individuales son:<br>
			<b>StopObjects:</b> Al seleccionarlo los objetos se detienen y al dar click en alg&uacute;n objeto comienza a rotar sobre sus ejes. Al deseleccionarlo los objetos vuelven a moverse.<br><br>

			<b>enabledSatellites:</b>  Aperecen peque&ntilde;as esferas que orbitan a los objetos, simulando lunas o sat&eacute;lites ,ver figura3.<br><br> 

			Para poder observar de mejor manera todas las funciones se adjunta este video:<br>
			<a href="https://www.youtube.com/watch?v=5ZvurbVl-vU&feature=youtu.be"> Video</a><br><br>

			

		</p>
				
		
	</body>
</html>